{
    "en": {
        "tech": [
            "Java",
            "Swing (GUI)",
            "Multithreading",
            "OS Fundamentals"
        ],
        "features": [
            "Batch process loading via custom .prs files",
            "Round Robin scheduling simulation (1-4 CPU cores)",
            "Memory management with First-Fit allocation strategy",
            "Real-time visualization of memory blocks and process queues",
            "Full simulation control: Start, Pause, Resume, Reset"
        ],
        "stack": {
            "language": "Java",
            "framework": "Swing",
            "tools": [
                "JDK 11+",
                "IntelliJ / Eclipse"
            ],
            "database": "In-Memory State"
        },
        "screenshots": [],
        "description": "A specialized educational laboratory designed to visualize the internal mechanics of Operating Systems. Developed in Java, the simulator provides a real-time playback of process lifecycles, using multithreaded cores to simulate multitasking via Round Robin scheduling. It includes a complete memory management module that demonstrates the First-Fit allocation strategy across high-density blocks, allowing students and engineers to observe state transitions, resource competition, and fragmentation in a controlled interactive environment."
    },
    "es": {
        "tech": [
            "Java",
            "Swing (GUI)",
            "Multihilos",
            "Fundamentos de SO"
        ],
        "features": [
            "Carga masiva de procesos mediante archivos .prs personalizados",
            "Simulación de planificación Round Robin (1-4 núcleos de CPU)",
            "Gestión de memoria con estrategia de asignación First-Fit",
            "Visualización en tiempo real de bloques de memoria y colas de procesos",
            "Control total de simulación: Iniciar, Pausar, Continuar, Reiniciar"
        ],
        "stack": {
            "language": "Java",
            "framework": "Swing",
            "tools": [
                "JDK 11+",
                "IntelliJ / Eclipse"
            ],
            "database": "Estado en Memoria"
        },
        "screenshots": [],
        "description": "Un laboratorio educativo especializado diseñado para visualizar la mecánica interna de los Sistemas Operativos. Desarrollado en Java, el simulador proporciona una reproducción en tiempo real del ciclo de vida de los procesos, utilizando núcleos multihilos para simular la multitarea mediante planificación Round Robin. Incluye un módulo de gestión de memoria que demuestra la estrategia First-Fit, permitiendo observar transiciones de estado, competencia por recursos y fragmentación en un entorno interactivo."
    }
}